# 2 Filtering data

In chapter 1, we have seen how to retrieve data with select. Now you may want to know how can we only retrieve the data that interest us,
but not all the rows. We can use the **where** statement to filter data that satisfied certain conditions.

In [1]:
% load_ext sql
% config SqlMagic.autocommit=False
% config SqlMagic.autolimit=20
% config SqlMagic.displaylimit=20
% sql postgresql: // pliu:pliu @ 127.0.0.1:5432 / north_wind

In [3]:
%%sql
SELECT * from orders limit 5;

 * postgresql://pliu:***@127.0.0.1:5432/north_wind
5 rows affected.

[(10248, 'VINET', 5, datetime.date(1996, 7, 4), datetime.date(1996, 8, 1), datetime.date(1996, 7, 16), 3, 32.38, 'Vins et alcools Chevalier', "59 rue de l'Abbaye", 'Reims', None, '51100', 'France'),
 (10249, 'TOMSP', 6, datetime.date(1996, 7, 5), datetime.date(1996, 8, 16), datetime.date(1996, 7, 10), 1, 11.61, 'Toms Spezialitäten', 'Luisenstr. 48', 'Münster', None, '44087', 'Germany'),
 (10250, 'HANAR', 4, datetime.date(1996, 7, 8), datetime.date(1996, 8, 5), datetime.date(1996, 7, 12), 2, 65.83, 'Hanari Carnes', 'Rua do Paço, 67', 'Rio de Janeiro', 'RJ', '05454-876', 'Brazil'),
 (10251, 'VICTE', 3, datetime.date(1996, 7, 8), datetime.date(1996, 8, 5), datetime.date(1996, 7, 15), 1, 41.34, 'Victuailles en stock', '2, rue du Commerce', 'Lyon', None, '69004', 'France'),
 (10252, 'SUPRD', 4, datetime.date(1996, 7, 9), datetime.date(1996, 8, 6), datetime.date(1996, 7, 11), 2, 51.3, 'Suprêmes délices', 'Boulevard Tirou, 255', 'Charleroi', None, 'B-6000', 'Belgium')]

## 2.1 Filtering digit columns

To filter digit column, we need to build a boolean expression such as column_name comparator value

Possible comparators:
- equality : =
- inequality : !=, or <>
- greater than: >
- less than : <
- Greater than equal to : >=
- Less than equal to : <=

Below query is an example, in the boolean expression column name is order_date (we extract the year from the date), comparator is =, value is 1996
This query should only return records where the order_date equals to 1996

In [4]:
%%sql
select * from orders where extract(year from order_date)=1996 limit 5

 * postgresql://pliu:***@127.0.0.1:5432/north_wind
5 rows affected.

[(10248, 'VINET', 5, datetime.date(1996, 7, 4), datetime.date(1996, 8, 1), datetime.date(1996, 7, 16), 3, 32.38, 'Vins et alcools Chevalier', "59 rue de l'Abbaye", 'Reims', None, '51100', 'France'),
 (10249, 'TOMSP', 6, datetime.date(1996, 7, 5), datetime.date(1996, 8, 16), datetime.date(1996, 7, 10), 1, 11.61, 'Toms Spezialitäten', 'Luisenstr. 48', 'Münster', None, '44087', 'Germany'),
 (10250, 'HANAR', 4, datetime.date(1996, 7, 8), datetime.date(1996, 8, 5), datetime.date(1996, 7, 12), 2, 65.83, 'Hanari Carnes', 'Rua do Paço, 67', 'Rio de Janeiro', 'RJ', '05454-876', 'Brazil'),
 (10251, 'VICTE', 3, datetime.date(1996, 7, 8), datetime.date(1996, 8, 5), datetime.date(1996, 7, 15), 1, 41.34, 'Victuailles en stock', '2, rue du Commerce', 'Lyon', None, '69004', 'France'),
 (10252, 'SUPRD', 4, datetime.date(1996, 7, 9), datetime.date(1996, 8, 6), datetime.date(1996, 7, 11), 2, 51.3, 'Suprêmes délices', 'Boulevard Tirou, 255', 'Charleroi', None, 'B-6000', 'Belgium')]

What if I want to get all records where year is not equals to 2010. There are two possible ways (!=, or <>) to express inequality. Most database servers such as Mysql, Postgresql, SQLite, etc. support both. However, some database server such as **Microsoft Access and IBM DB2 only support <>**.

In [5]:
%%sql
select * from orders where extract(year from order_date)!=1996 limit 5

 * postgresql://pliu:***@127.0.0.1:5432/north_wind
5 rows affected.

[(10400, 'EASTC', 1, datetime.date(1997, 1, 1), datetime.date(1997, 1, 29), datetime.date(1997, 1, 16), 3, 83.93, 'Eastern Connection', '35 King George', 'London', None, 'WX3 6FW', 'UK'),
 (10401, 'RATTC', 1, datetime.date(1997, 1, 1), datetime.date(1997, 1, 29), datetime.date(1997, 1, 10), 1, 12.51, 'Rattlesnake Canyon Grocery', '2817 Milton Dr.', 'Albuquerque', 'NM', '87110', 'USA'),
 (10402, 'ERNSH', 8, datetime.date(1997, 1, 2), datetime.date(1997, 2, 13), datetime.date(1997, 1, 10), 2, 67.88, 'Ernst Handel', 'Kirchgasse 6', 'Graz', None, '8010', 'Austria'),
 (10403, 'ERNSH', 4, datetime.date(1997, 1, 3), datetime.date(1997, 1, 31), datetime.date(1997, 1, 9), 3, 73.79, 'Ernst Handel', 'Kirchgasse 6', 'Graz', None, '8010', 'Austria'),
 (10404, 'MAGAA', 2, datetime.date(1997, 1, 3), datetime.date(1997, 1, 31), datetime.date(1997, 1, 8), 1, 155.97, 'Magazzini Alimentari Riuniti', 'Via Ludovico il Moro 22', 'Bergamo', None, '24100', 'Italy')]

In [6]:
%%sql
select * from orders where extract(year from order_date)<>1996 limit 5

 * postgresql://pliu:***@127.0.0.1:5432/north_wind
5 rows affected.

[(10400, 'EASTC', 1, datetime.date(1997, 1, 1), datetime.date(1997, 1, 29), datetime.date(1997, 1, 16), 3, 83.93, 'Eastern Connection', '35 King George', 'London', None, 'WX3 6FW', 'UK'),
 (10401, 'RATTC', 1, datetime.date(1997, 1, 1), datetime.date(1997, 1, 29), datetime.date(1997, 1, 10), 1, 12.51, 'Rattlesnake Canyon Grocery', '2817 Milton Dr.', 'Albuquerque', 'NM', '87110', 'USA'),
 (10402, 'ERNSH', 8, datetime.date(1997, 1, 2), datetime.date(1997, 2, 13), datetime.date(1997, 1, 10), 2, 67.88, 'Ernst Handel', 'Kirchgasse 6', 'Graz', None, '8010', 'Austria'),
 (10403, 'ERNSH', 4, datetime.date(1997, 1, 3), datetime.date(1997, 1, 31), datetime.date(1997, 1, 9), 3, 73.79, 'Ernst Handel', 'Kirchgasse 6', 'Graz', None, '8010', 'Austria'),
 (10404, 'MAGAA', 2, datetime.date(1997, 1, 3), datetime.date(1997, 1, 31), datetime.date(1997, 1, 8), 1, 155.97, 'Magazzini Alimentari Riuniti', 'Via Ludovico il Moro 22', 'Bergamo', None, '24100', 'Italy')]

These two queries do the same thing. You should see the same output.

We can also qualify inclusive ranges using a BETWEEN statement, as shown here
(“inclusive” means that 1996 and 1997 are included in the range):

In [7]:
%%sql
select *
from orders
where extract(year from order_date) between 1996 and 1997
limit 5

 * postgresql://pliu:***@127.0.0.1:5432/north_wind
5 rows affected.

[(10248, 'VINET', 5, datetime.date(1996, 7, 4), datetime.date(1996, 8, 1), datetime.date(1996, 7, 16), 3, 32.38, 'Vins et alcools Chevalier', "59 rue de l'Abbaye", 'Reims', None, '51100', 'France'),
 (10249, 'TOMSP', 6, datetime.date(1996, 7, 5), datetime.date(1996, 8, 16), datetime.date(1996, 7, 10), 1, 11.61, 'Toms Spezialitäten', 'Luisenstr. 48', 'Münster', None, '44087', 'Germany'),
 (10250, 'HANAR', 4, datetime.date(1996, 7, 8), datetime.date(1996, 8, 5), datetime.date(1996, 7, 12), 2, 65.83, 'Hanari Carnes', 'Rua do Paço, 67', 'Rio de Janeiro', 'RJ', '05454-876', 'Brazil'),
 (10251, 'VICTE', 3, datetime.date(1996, 7, 8), datetime.date(1996, 8, 5), datetime.date(1996, 7, 15), 1, 41.34, 'Victuailles en stock', '2, rue du Commerce', 'Lyon', None, '69004', 'France'),
 (10252, 'SUPRD', 4, datetime.date(1996, 7, 9), datetime.date(1996, 8, 6), datetime.date(1996, 7, 11), 2, 51.3, 'Suprêmes délices', 'Boulevard Tirou, 255', 'Charleroi', None, 'B-6000', 'Belgium')]

## 2.2 Combining multiple filtering condition

### 2.2.1 And operator

We can express the "between and" range with another expression. For instance the year must be greater than or equal to 2005 and less than or equal to 2010. We need to add two filter and combine the result of the two filter with an **and**.

Below query should return exactly the same result as the above query

In [9]:
%%sql
select *
from orders
where extract(year from order_date) >= 1996 and extract(year from order_date)<= 1997
limit 5

 * postgresql://pliu:***@127.0.0.1:5432/north_wind
5 rows affected.

[(10248, 'VINET', 5, datetime.date(1996, 7, 4), datetime.date(1996, 8, 1), datetime.date(1996, 7, 16), 3, 32.38, 'Vins et alcools Chevalier', "59 rue de l'Abbaye", 'Reims', None, '51100', 'France'),
 (10249, 'TOMSP', 6, datetime.date(1996, 7, 5), datetime.date(1996, 8, 16), datetime.date(1996, 7, 10), 1, 11.61, 'Toms Spezialitäten', 'Luisenstr. 48', 'Münster', None, '44087', 'Germany'),
 (10250, 'HANAR', 4, datetime.date(1996, 7, 8), datetime.date(1996, 8, 5), datetime.date(1996, 7, 12), 2, 65.83, 'Hanari Carnes', 'Rua do Paço, 67', 'Rio de Janeiro', 'RJ', '05454-876', 'Brazil'),
 (10251, 'VICTE', 3, datetime.date(1996, 7, 8), datetime.date(1996, 8, 5), datetime.date(1996, 7, 15), 1, 41.34, 'Victuailles en stock', '2, rue du Commerce', 'Lyon', None, '69004', 'France'),
 (10252, 'SUPRD', 4, datetime.date(1996, 7, 9), datetime.date(1996, 8, 6), datetime.date(1996, 7, 11), 2, 51.3, 'Suprêmes délices', 'Boulevard Tirou, 255', 'Charleroi', None, 'B-6000', 'Belgium')]

Note the "between and" express an inclusive range, for not inclusive range, we can not use it. As a result, evaluate the and of two filters become very useful. Below query returns orders that order_date > 1996 and < 1998.

In [10]:
%%sql
select *
from orders
where extract(year from order_date) > 1996 and extract(year from order_date)< 1998
limit 5

 * postgresql://pliu:***@127.0.0.1:5432/north_wind
5 rows affected.

[(10400, 'EASTC', 1, datetime.date(1997, 1, 1), datetime.date(1997, 1, 29), datetime.date(1997, 1, 16), 3, 83.93, 'Eastern Connection', '35 King George', 'London', None, 'WX3 6FW', 'UK'),
 (10401, 'RATTC', 1, datetime.date(1997, 1, 1), datetime.date(1997, 1, 29), datetime.date(1997, 1, 10), 1, 12.51, 'Rattlesnake Canyon Grocery', '2817 Milton Dr.', 'Albuquerque', 'NM', '87110', 'USA'),
 (10402, 'ERNSH', 8, datetime.date(1997, 1, 2), datetime.date(1997, 2, 13), datetime.date(1997, 1, 10), 2, 67.88, 'Ernst Handel', 'Kirchgasse 6', 'Graz', None, '8010', 'Austria'),
 (10403, 'ERNSH', 4, datetime.date(1997, 1, 3), datetime.date(1997, 1, 31), datetime.date(1997, 1, 9), 3, 73.79, 'Ernst Handel', 'Kirchgasse 6', 'Graz', None, '8010', 'Austria'),
 (10404, 'MAGAA', 2, datetime.date(1997, 1, 3), datetime.date(1997, 1, 31), datetime.date(1997, 1, 8), 1, 155.97, 'Magazzini Alimentari Riuniti', 'Via Ludovico il Moro 22', 'Bergamo', None, '24100', 'Italy')]

### 2.2.2 Or operator

The OR operator will return the record if at least one of the criteria is true for the record. For instance, if we wanted only orders with months 3, 6, 9, or 12, we can use below query:

In [11]:
%%sql
select * from orders
where extract(month from order_date)=3
or extract(month from order_date)=6
or extract(month from order_date)=9
or extract(month from order_date)=12
limit 5;

 * postgresql://pliu:***@127.0.0.1:5432/north_wind
5 rows affected.

[(10295, 'VINET', 2, datetime.date(1996, 9, 2), datetime.date(1996, 9, 30), datetime.date(1996, 9, 10), 2, 1.15, 'Vins et alcools Chevalier', "59 rue de l'Abbaye", 'Reims', None, '51100', 'France'),
 (10296, 'LILAS', 6, datetime.date(1996, 9, 3), datetime.date(1996, 10, 1), datetime.date(1996, 9, 11), 1, 0.12, 'LILA-Supermercado', 'Carrera 52 con Ave. Bolívar #65-98 Llano Largo', 'Barquisimeto', 'Lara', '3508', 'Venezuela'),
 (10297, 'BLONP', 5, datetime.date(1996, 9, 4), datetime.date(1996, 10, 16), datetime.date(1996, 9, 10), 2, 5.74, 'Blondel père et fils', '24, place Kléber', 'Strasbourg', None, '67000', 'France'),
 (10298, 'HUNGO', 6, datetime.date(1996, 9, 5), datetime.date(1996, 10, 3), datetime.date(1996, 9, 11), 2, 168.22, 'Hungry Owl All-Night Grocers', '8 Johnstown Road', 'Cork', 'Co. Cork', None, 'Ireland'),
 (10299, 'RICAR', 4, datetime.date(1996, 9, 6), datetime.date(1996, 10, 4), datetime.date(1996, 9, 13), 2, 29.76, 'Ricardo Adocicados', 'Av. Copacabana, 267', 'Rio de Janeiro', 'RJ', '02389-890', 'Brazil')]


### 2.2.3 In operator

In the above example, we tested column month with a list of possible value. In this kind of situation, we can use the **In** operator.

In [12]:
%%sql
select * from orders
where extract(month from order_date) in (3,6,9,12)
limit 5;

 * postgresql://pliu:***@127.0.0.1:5432/north_wind
5 rows affected.

[(10295, 'VINET', 2, datetime.date(1996, 9, 2), datetime.date(1996, 9, 30), datetime.date(1996, 9, 10), 2, 1.15, 'Vins et alcools Chevalier', "59 rue de l'Abbaye", 'Reims', None, '51100', 'France'),
 (10296, 'LILAS', 6, datetime.date(1996, 9, 3), datetime.date(1996, 10, 1), datetime.date(1996, 9, 11), 1, 0.12, 'LILA-Supermercado', 'Carrera 52 con Ave. Bolívar #65-98 Llano Largo', 'Barquisimeto', 'Lara', '3508', 'Venezuela'),
 (10297, 'BLONP', 5, datetime.date(1996, 9, 4), datetime.date(1996, 10, 16), datetime.date(1996, 9, 10), 2, 5.74, 'Blondel père et fils', '24, place Kléber', 'Strasbourg', None, '67000', 'France'),
 (10298, 'HUNGO', 6, datetime.date(1996, 9, 5), datetime.date(1996, 10, 3), datetime.date(1996, 9, 11), 2, 168.22, 'Hungry Owl All-Night Grocers', '8 Johnstown Road', 'Cork', 'Co. Cork', None, 'Ireland'),
 (10299, 'RICAR', 4, datetime.date(1996, 9, 6), datetime.date(1996, 10, 4), datetime.date(1996, 9, 13), 2, 29.76, 'Ricardo Adocicados', 'Av. Copacabana, 267', 'Rio de Janeiro', 'RJ', '02389-890', 'Brazil')]

We can also express the negation of the in operator by adding not in front of **in** operator.

In [14]:
%%sql
select * from orders
where extract(month from order_date) not in (3,6,9,12)
limit 5;

 * postgresql://pliu:***@127.0.0.1:5432/north_wind
5 rows affected.

[(10248, 'VINET', 5, datetime.date(1996, 7, 4), datetime.date(1996, 8, 1), datetime.date(1996, 7, 16), 3, 32.38, 'Vins et alcools Chevalier', "59 rue de l'Abbaye", 'Reims', None, '51100', 'France'),
 (10249, 'TOMSP', 6, datetime.date(1996, 7, 5), datetime.date(1996, 8, 16), datetime.date(1996, 7, 10), 1, 11.61, 'Toms Spezialitäten', 'Luisenstr. 48', 'Münster', None, '44087', 'Germany'),
 (10250, 'HANAR', 4, datetime.date(1996, 7, 8), datetime.date(1996, 8, 5), datetime.date(1996, 7, 12), 2, 65.83, 'Hanari Carnes', 'Rua do Paço, 67', 'Rio de Janeiro', 'RJ', '05454-876', 'Brazil'),
 (10251, 'VICTE', 3, datetime.date(1996, 7, 8), datetime.date(1996, 8, 5), datetime.date(1996, 7, 15), 1, 41.34, 'Victuailles en stock', '2, rue du Commerce', 'Lyon', None, '69004', 'France'),
 (10252, 'SUPRD', 4, datetime.date(1996, 7, 9), datetime.date(1996, 8, 6), datetime.date(1996, 7, 11), 2, 51.3, 'Suprêmes délices', 'Boulevard Tirou, 255', 'Charleroi', None, 'B-6000', 'Belgium')]

### 2.2.4 Arithmetic operators

We can notice 3,6,9,12 can all be divided by 3. So we can also use another way to get the same records as above examples.


**Note some database such as Oracle does not support the modulus operator. It instead uses the MOD() function.**

In [17]:
%%sql
select * from orders
where cast(extract(month from order_date) as integer ) %3=0
limit 5;

 * postgresql://pliu:***@127.0.0.1:5432/north_wind
5 rows affected.

[(10295, 'VINET', 2, datetime.date(1996, 9, 2), datetime.date(1996, 9, 30), datetime.date(1996, 9, 10), 2, 1.15, 'Vins et alcools Chevalier', "59 rue de l'Abbaye", 'Reims', None, '51100', 'France'),
 (10296, 'LILAS', 6, datetime.date(1996, 9, 3), datetime.date(1996, 10, 1), datetime.date(1996, 9, 11), 1, 0.12, 'LILA-Supermercado', 'Carrera 52 con Ave. Bolívar #65-98 Llano Largo', 'Barquisimeto', 'Lara', '3508', 'Venezuela'),
 (10297, 'BLONP', 5, datetime.date(1996, 9, 4), datetime.date(1996, 10, 16), datetime.date(1996, 9, 10), 2, 5.74, 'Blondel père et fils', '24, place Kléber', 'Strasbourg', None, '67000', 'France'),
 (10298, 'HUNGO', 6, datetime.date(1996, 9, 5), datetime.date(1996, 10, 3), datetime.date(1996, 9, 11), 2, 168.22, 'Hungry Owl All-Night Grocers', '8 Johnstown Road', 'Cork', 'Co. Cork', None, 'Ireland'),
 (10299, 'RICAR', 4, datetime.date(1996, 9, 6), datetime.date(1996, 10, 4), datetime.date(1996, 9, 13), 2, 29.76, 'Ricardo Adocicados', 'Av. Copacabana, 267', 'Rio de Janeiro', 'RJ', '02389-890', 'Brazil')]

## 2.3 Filtering text columns

The rules for qualifying text fields follow the same structure, although there are subtle(small) differences. You can
**use =, AND, OR, and IN statements with text**. However, when using text, you must wrap literals (or text values you specify) **in single quotes**.

In [18]:
%%sql
SELECT * FROM orders
WHERE ship_city = 'Paris'
limit 5;

 * postgresql://pliu:***@127.0.0.1:5432/north_wind
4 rows affected.

[(10738, 'SPECD', 2, datetime.date(1997, 11, 12), datetime.date(1997, 12, 10), datetime.date(1997, 11, 18), 1, 2.91, 'Spécialités du monde', '25, rue Lauriston', 'Paris', None, '75016', 'France'),
 (10907, 'SPECD', 6, datetime.date(1998, 2, 25), datetime.date(1998, 3, 25), datetime.date(1998, 2, 27), 3, 9.19, 'Spécialités du monde', '25, rue Lauriston', 'Paris', None, '75016', 'France'),
 (10964, 'SPECD', 3, datetime.date(1998, 3, 20), datetime.date(1998, 4, 17), datetime.date(1998, 3, 24), 2, 87.38, 'Spécialités du monde', '25, rue Lauriston', 'Paris', None, '75016', 'France'),
 (11043, 'SPECD', 5, datetime.date(1998, 4, 22), datetime.date(1998, 5, 20), datetime.date(1998, 4, 29), 2, 8.8, 'Spécialités du monde', '25, rue Lauriston', 'Paris', None, '75016', 'France')]

Note **postgresql does not support double quote** on string value. So below query will return error in postgresql. It works for Mysql or Sqlite

In [19]:
%%sql
SELECT * FROM orders
WHERE ship_city = "Paris"
limit 5;

 * postgresql://pliu:***@127.0.0.1:5432/north_wind
(psycopg2.errors.UndefinedColumn) column "Paris" does not exist
LINE 2: WHERE ship_city = "Paris"
                          ^

[SQL: SELECT * FROM orders
WHERE ship_city = "Paris"
limit 5;]
(Background on this error at: https://sqlalche.me/e/14/f405)

If we do not add " or ' on Paris, the database server will get confused and think Paris is a column name rather than a text value. This single-quote rule applies to all text operations. For example, below query will return error.

In [20]:
%%sql
SELECT * FROM orders
WHERE ship_city = Paris
limit 5;

 * postgresql://pliu:***@127.0.0.1:5432/north_wind
(psycopg2.errors.UndefinedColumn) column "paris" does not exist
LINE 2: WHERE ship_city = Paris
                          ^

[SQL: SELECT * FROM orders
WHERE ship_city = Paris
limit 5;]
(Background on this error at: https://sqlalche.me/e/14/f405)

We can also use string value in other filter operations. Below query will return all rows that the ship_city is Paris, London, or Madrid.

In [21]:
%%sql
SELECT * FROM orders
WHERE ship_city in ('Paris','London','Madrid')
limit 5;

 * postgresql://pliu:***@127.0.0.1:5432/north_wind
5 rows affected.

[(10281, 'ROMEY', 4, datetime.date(1996, 8, 14), datetime.date(1996, 8, 28), datetime.date(1996, 8, 21), 1, 2.94, 'Romero y tomillo', 'Gran Vía, 1', 'Madrid', None, '28001', 'Spain'),
 (10282, 'ROMEY', 4, datetime.date(1996, 8, 15), datetime.date(1996, 9, 12), datetime.date(1996, 8, 21), 1, 12.69, 'Romero y tomillo', 'Gran Vía, 1', 'Madrid', None, '28001', 'Spain'),
 (10289, 'BSBEV', 7, datetime.date(1996, 8, 26), datetime.date(1996, 9, 23), datetime.date(1996, 8, 28), 3, 22.77, "B's Beverages", 'Fauntleroy Circus', 'London', None, 'EC2 5NT', 'UK'),
 (10306, 'ROMEY', 1, datetime.date(1996, 9, 16), datetime.date(1996, 10, 14), datetime.date(1996, 9, 23), 3, 7.56, 'Romero y tomillo', 'Gran Vía, 1', 'Madrid', None, '28001', 'Spain'),
 (10326, 'BOLID', 4, datetime.date(1996, 10, 10), datetime.date(1996, 11, 7), datetime.date(1996, 10, 14), 2, 77.92, 'Bólido Comidas preparadas', 'C/ Araquil, 67', 'Madrid', None, '28023', 'Spain')]

### 2.3.1 Other useful functions

#### filter by using length

**length** operator can get the length of a text field. For instance, below query will filter all rows that ship_country length is <=2 (e.g. UK).

In [23]:
%%sql
SELECT * FROM orders
WHERE length(ship_country) <= 2
limit 5

 * postgresql://pliu:***@127.0.0.1:5432/north_wind
5 rows affected.

[(10289, 'BSBEV', 7, datetime.date(1996, 8, 26), datetime.date(1996, 9, 23), datetime.date(1996, 8, 28), 3, 22.77, "B's Beverages", 'Fauntleroy Circus', 'London', None, 'EC2 5NT', 'UK'),
 (10315, 'ISLAT', 4, datetime.date(1996, 9, 26), datetime.date(1996, 10, 24), datetime.date(1996, 10, 3), 2, 41.76, 'Island Trading', 'Garden House Crowther Way', 'Cowes', 'Isle of Wight', 'PO31 7PJ', 'UK'),
 (10318, 'ISLAT', 8, datetime.date(1996, 10, 1), datetime.date(1996, 10, 29), datetime.date(1996, 10, 4), 2, 4.73, 'Island Trading', 'Garden House Crowther Way', 'Cowes', 'Isle of Wight', 'PO31 7PJ', 'UK'),
 (10321, 'ISLAT', 3, datetime.date(1996, 10, 3), datetime.date(1996, 10, 31), datetime.date(1996, 10, 11), 2, 3.43, 'Island Trading', 'Garden House Crowther Way', 'Cowes', 'Isle of Wight', 'PO31 7PJ', 'UK'),
 (10355, 'AROUT', 6, datetime.date(1996, 11, 15), datetime.date(1996, 12, 13), datetime.date(1996, 11, 20), 1, 41.95, 'Around the Horn', 'Brook Farm Stratford St. Mary', 'Colchester', 'Essex', 'CO7 6JX', 'UK')]

#### Wild card text filtering with like operator

Another common operation is to use wildcards with LIKE followed by a regular expression, in the regular expression:
- % : means any number of characters an
- _ : means any single character.
- Any other character is interpreted literally.

So, if you wanted to find all orders that have ship_country start with the letter “C” you would run below query to find “A” followed by any characters

In [24]:
%%sql
select * from orders
where ship_country like 'C%'
limit 5;

 * postgresql://pliu:***@127.0.0.1:5432/north_wind
5 rows affected.

[(10332, 'MEREP', 3, datetime.date(1996, 10, 17), datetime.date(1996, 11, 28), datetime.date(1996, 10, 21), 2, 52.84, 'Mère Paillarde', '43 rue St. Laurent', 'Montréal', 'Québec', 'H1J 1C3', 'Canada'),
 (10339, 'MEREP', 2, datetime.date(1996, 10, 28), datetime.date(1996, 11, 25), datetime.date(1996, 11, 4), 2, 15.66, 'Mère Paillarde', '43 rue St. Laurent', 'Montréal', 'Québec', 'H1J 1C3', 'Canada'),
 (10376, 'MEREP', 1, datetime.date(1996, 12, 9), datetime.date(1997, 1, 6), datetime.date(1996, 12, 13), 2, 20.39, 'Mère Paillarde', '43 rue St. Laurent', 'Montréal', 'Québec', 'H1J 1C3', 'Canada'),
 (10389, 'BOTTM', 4, datetime.date(1996, 12, 20), datetime.date(1997, 1, 17), datetime.date(1996, 12, 24), 2, 47.42, 'Bottom-Dollar Markets', '23 Tsawassen Blvd.', 'Tsawassen', 'BC', 'T2F 8M4', 'Canada'),
 (10410, 'BOTTM', 3, datetime.date(1997, 1, 10), datetime.date(1997, 2, 7), datetime.date(1997, 1, 15), 3, 2.4, 'Bottom-Dollar Markets', '23 Tsawassen Blvd.', 'Tsawassen', 'BC', 'T2F 8M4', 'Canada')]

If you wanted all report codes that have a “C” as the first character and a “n” as the third character, **note the character inside '' is  case-sensitive unlike the query command**. Try change below query to 'C_N' and see what happens.

In [26]:
%%sql
select * from orders
where ship_country like 'C_n%'
limit 5;

 * postgresql://pliu:***@127.0.0.1:5432/north_wind
5 rows affected.

[(10332, 'MEREP', 3, datetime.date(1996, 10, 17), datetime.date(1996, 11, 28), datetime.date(1996, 10, 21), 2, 52.84, 'Mère Paillarde', '43 rue St. Laurent', 'Montréal', 'Québec', 'H1J 1C3', 'Canada'),
 (10339, 'MEREP', 2, datetime.date(1996, 10, 28), datetime.date(1996, 11, 25), datetime.date(1996, 11, 4), 2, 15.66, 'Mère Paillarde', '43 rue St. Laurent', 'Montréal', 'Québec', 'H1J 1C3', 'Canada'),
 (10376, 'MEREP', 1, datetime.date(1996, 12, 9), datetime.date(1997, 1, 6), datetime.date(1996, 12, 13), 2, 20.39, 'Mère Paillarde', '43 rue St. Laurent', 'Montréal', 'Québec', 'H1J 1C3', 'Canada'),
 (10389, 'BOTTM', 4, datetime.date(1996, 12, 20), datetime.date(1997, 1, 17), datetime.date(1996, 12, 24), 2, 47.42, 'Bottom-Dollar Markets', '23 Tsawassen Blvd.', 'Tsawassen', 'BC', 'T2F 8M4', 'Canada'),
 (10410, 'BOTTM', 3, datetime.date(1997, 1, 10), datetime.date(1997, 2, 7), datetime.date(1997, 1, 15), 3, 2.4, 'Bottom-Dollar Markets', '23 Tsawassen Blvd.', 'Tsawassen', 'BC', 'T2F 8M4', 'Canada')]

## 2.4 Filtering boolean column

Booleans are true/false values. In the database world, typically **false is expressed as 0 and true is expressed as 1**. Some database platforms **(like MySQL) allow you to implicitly use the words true and false**

**SQLite, however, does not support this. It expects you to explicitly use 1 for true and 0 for false**. For instance, below query gets all records where there was tornado and hail:

In [30]:
%%sql
select * from station_data
where tornado=1 AND hail=1
limit 5;

 * postgresql://pliu:***@127.0.0.1:5432/weather_stations
5 rows affected.

[(143080, '34DDA7', 2002, 12, 21, Decimal('33.799999999999997158'), Decimal('987.39999999999997727'), Decimal('3.3999999999999999111'), Decimal('0.2000000000000000111'), Decimal('36'), Decimal('0'), None, 1, 1, 1, 1, 1),
 (724320, '207979', 1988, 3, 4, Decimal('33.100000000000001421'), Decimal('999.39999999999997726'), Decimal('3.1000000000000000888'), Decimal('9.3000000000000007105'), Decimal('35.10000000000000142'), Decimal('0.23000000000000000999'), None, 1, 1, 1, 1, 1),
 (743920, '2ABE7D', 1996, 5, 21, Decimal('57.60000000000000142'), None, Decimal('5.7999999999999998223'), Decimal('7.5'), Decimal('70'), Decimal('0'), None, 1, 1, 1, 1, 1),
 (724460, 'B9B8B2', 1986, 10, 2, Decimal('64.200000000000002841'), Decimal('976'), Decimal('5.5'), Decimal('6.5'), Decimal('65.400000000000005685'), Decimal('0.60999999999999998667'), None, 1, 1, 1, 1, 1),
 (700450, '77D245', 1985, 11, 4, Decimal('-12.199999999999999289'), Decimal('1023.7000000000000454'), Decimal('6.2000000000000001776'), Decimal('16.30000000000000071'), Decimal('-7.2000000000000001776'), Decimal('0'), Decimal('0.8000000000000000444'), 1, 1, 1, 1, 1)]

If you are looking for just true values, you do not even have to use the "= 1" expression. Because the fields are already Boolean (behind the scenes,
every **WHERE condition boils down to a Boolean expression**), they inherently qualify by themselves. Hence, you can achieve the same results by running the following query:

In [ ]:
%%sql
select * from station_data
where tornado AND hail;

However, qualifying for false conditions needs to be explicit. To get all records with no tornado but with hail, run this query:

In [ ]:
%%sql
SELECT * FROM station_data
WHERE tornado = 0 AND hail = 1;

You can also use the NOT keyword to qualify tornado as false:

In [ ]:
%%sql
SELECT * FROM station_data
WHERE NOT tornado AND hail;

## 2.5 Handling null

You may have noticed that some columns, such as station_pressure and snow_depth , have null values. **A null is a value that has no value. It is the complete absence of any content. It is a vacuous state**.

In sql, **Null values cannot be determined with an = . You need to use the IS NULL or IS NOT NULL statements to identify null values**

Below query returns all rows that snow_depth is null

In [33]:
%%sql
select * from station_data
where snow_depth is null
limit 5;

 * postgresql://pliu:***@127.0.0.1:5432/weather_stations
5 rows affected.

[(143080, '34DDA7', 2002, 12, 21, Decimal('33.799999999999997158'), Decimal('987.39999999999997727'), Decimal('3.3999999999999999111'), Decimal('0.2000000000000000111'), Decimal('36'), Decimal('0'), None, 1, 1, 1, 1, 1),
 (766440, '39537B', 1998, 10, 1, Decimal('72.70000000000000284'), Decimal('1014.6000000000000227'), Decimal('5.9000000000000003552'), Decimal('6.7000000000000001776'), Decimal('83.299999999999997154'), Decimal('0'), None, 0, 0, 0, 0, 0),
 (176010, 'C3C6D5', 2001, 5, 18, Decimal('55.700000000000002842'), None, Decimal('7.2999999999999998223'), Decimal('4.2999999999999998223'), Decimal('69.099999999999994317'), Decimal('0'), None, 0, 0, 0, 0, 0),
 (125600, '145150', 2007, 10, 14, Decimal('33'), None, Decimal('6.9000000000000003552'), Decimal('2.5'), Decimal('39.700000000000002843'), Decimal('0'), None, 0, 0, 0, 0, 0),
 (470160, 'EF616A', 1967, 7, 29, Decimal('65.599999999999994313'), None, Decimal('9.1999999999999992894'), Decimal('1.1999999999999999555'), Decimal('72.400000000000005683'), Decimal('0.040000000000000000832'), None, 0, 0, 0, 0, 0)]

### 2.5.1 Why we even have null values in the database? Can we replace null by 0 for snow_depth?

The null values is useful for some use case. For example, for column such as snow_depth or precipitation, it does make sense. Not because it was a sunny day (in this case, it is better to record the values as 0), but rather because some stations might not have the necessary instruments to take those measurements. It might be misleading to set those values to 0 (which implies data was recorded), so those measurements should be left null.

In some columns, we can not have null values. For example, the **station_number** column should be designed that it never allows nulls. Because if it's null, all the rest columns of this row become orphan data that belongs to no station.

We can see that nulls values are ambiguous and it can be difficult to determine their business meaning. It is important that nullable columns (columns that are allowed to have null values) **have documented what a null value means from a business perspective**. **Otherwise, nulls should be banned from those table columns**.

Do not confuse nulls with empty text(i.e., '' ). This also applies to whitespace text (i.e., ' ') . These will be treated as values and
never will be considered null. A null is definitely not the same as 0 either, because 0 is a value, whereas null is an absence of a value.

### 2.5.2 Problems caused by null values

We know that precipitation column has null values, try to run the following query. You can notice that the returned rows do not contain any null values. Because null is not 0 or any number, it will not qualify to any condition. So the **precipitation <= 0.5** filtered out all rows that contain null value.

In [35]:
%%sql
SELECT station_number, precipitation FROM station_data
WHERE precipitation <= 0.5
limit 5

 * postgresql://pliu:***@127.0.0.1:5432/weather_stations
5 rows affected.

[(143080, Decimal('0')),
 (766440, Decimal('0')),
 (176010, Decimal('0')),
 (125600, Decimal('0')),
 (470160, Decimal('0.040000000000000000832'))]

But having a null value does not mean the precipitation > 0.5, so we may want to keep those rows that have null values. We can have them by using the following query

In [36]:
%%sql
SELECT station_number, precipitation FROM station_data
WHERE precipitation is null
OR precipitation <= 0.5
limit 5

 * postgresql://pliu:***@127.0.0.1:5432/weather_stations
5 rows affected.

[(143080, Decimal('0')),
 (766440, Decimal('0')),
 (176010, Decimal('0')),
 (125600, Decimal('0')),
 (470160, Decimal('0.040000000000000000832'))]

The above query works, but we have a more elegant way of handling null values. We can use the **coalesce() function**
- coalesce(col_name,replacement_value): It takes a column name that may have null value, if the row value is null,
  then replace it with the given replacement_value.

Below query use coalesce to replace all null value of column precipitation by 0 than compare them with <=0.5. This will not modify the origin table.

In [38]:
%%sql
SELECT * FROM station_data
WHERE coalesce(precipitation, 0) <= 0.5
limit 5;

 * postgresql://pliu:***@127.0.0.1:5432/weather_stations
5 rows affected.

[(143080, '34DDA7', 2002, 12, 21, Decimal('33.799999999999997158'), Decimal('987.39999999999997727'), Decimal('3.3999999999999999111'), Decimal('0.2000000000000000111'), Decimal('36'), Decimal('0'), None, 1, 1, 1, 1, 1),
 (766440, '39537B', 1998, 10, 1, Decimal('72.70000000000000284'), Decimal('1014.6000000000000227'), Decimal('5.9000000000000003552'), Decimal('6.7000000000000001776'), Decimal('83.299999999999997154'), Decimal('0'), None, 0, 0, 0, 0, 0),
 (176010, 'C3C6D5', 2001, 5, 18, Decimal('55.700000000000002842'), None, Decimal('7.2999999999999998223'), Decimal('4.2999999999999998223'), Decimal('69.099999999999994317'), Decimal('0'), None, 0, 0, 0, 0, 0),
 (125600, '145150', 2007, 10, 14, Decimal('33'), None, Decimal('6.9000000000000003552'), Decimal('2.5'), Decimal('39.700000000000002843'), Decimal('0'), None, 0, 0, 0, 0, 0),
 (470160, 'EF616A', 1967, 7, 29, Decimal('65.599999999999994313'), None, Decimal('9.1999999999999992894'), Decimal('1.1999999999999999555'), Decimal('72.400000000000005683'), Decimal('0.040000000000000000832'), None, 0, 0, 0, 0, 0)]

If we want the other user can use the replaced value, we can create a new column by using below query

In [39]:
%%sql
SELECT report_code, coalesce(precipitation, 0) as rainfall
FROM station_data
limit 5;

 * postgresql://pliu:***@127.0.0.1:5432/weather_stations
5 rows affected.

[('34DDA7', Decimal('0')),
 ('39537B', Decimal('0')),
 ('C3C6D5', Decimal('0')),
 ('145150', Decimal('0')),
 ('EF616A', Decimal('0.040000000000000000832'))]

## 2.6 Grouping Conditions

When you start chaining "AND" and "OR" together, you need to make sure that you organize each set of conditions between each OR in a way that groups related conditions.

For example, we need to find all rows that snow or sleet(rain with snow). For sleet to happen, there must be rain and a temperature less than or equal to 32 degrees. We could write below query.

In [40]:
%%sql
SELECT * FROM station_data
WHERE rain = 1 AND temperature <= 32
OR snow_depth > 0
limit 5;

 * postgresql://pliu:***@127.0.0.1:5432/weather_stations
5 rows affected.

[(719200, 'C74611', 1978, 2, 5, Decimal('-4.4000000000000003552'), Decimal('962.89999999999997728'), Decimal('14.900000000000000355'), Decimal('13.30000000000000071'), Decimal('1.6000000000000000888'), Decimal('0'), Decimal('9.8000000000000007105'), 0, 0, 0, 0, 0),
 (29880, '921894', 1986, 12, 26, Decimal('13.900000000000000355'), None, Decimal('6.5999999999999996447'), Decimal('14.699999999999999289'), Decimal('16.80000000000000071'), Decimal('0.020000000000000000416'), Decimal('8.6999999999999992894'), 0, 0, 0, 0, 0),
 (700450, '77D245', 1985, 11, 4, Decimal('-12.199999999999999289'), Decimal('1023.7000000000000454'), Decimal('6.2000000000000001776'), Decimal('16.30000000000000071'), Decimal('-7.2000000000000001776'), Decimal('0'), Decimal('0.8000000000000000444'), 1, 1, 1, 1, 1),
 (28010, '423D51', 2004, 2, 15, Decimal('23.699999999999999289'), Decimal('953.70000000000004544'), None, Decimal('6.5999999999999996447'), Decimal('26'), Decimal('0.020000000000000000416'), Decimal('26.399999999999998578'), 0, 0, 0, 0, 0),
 (710830, 'FC6047', 2008, 1, 16, Decimal('-13.699999999999999289'), Decimal('990.6000000000000227'), Decimal('0.4000000000000000222'), Decimal('21.899999999999998578'), Decimal('-8.6999999999999992894'), Decimal('0.10000000000000000555'), Decimal('11.400000000000000355'), 0, 0, 0, 0, 0)]

We are lucky this works, because AND, OR have the same priority, sql resolve from left to right. So **rain = 1 AND temperature <= 32** resolved to a value, then this value get resolved with **OR snow_depth > 0**. But for a begginer, this can be confusing, he will wonder if AND condition get resolved first or the OR condition get resolved first.

To avoid this, we can explicitly group conditions in parentheses. This makes not only makes the semantics clearer, but also the execution safer.

In [41]:
%%sql
SELECT * FROM station_data
WHERE (rain = 1 AND temperature <= 32)
OR snow_depth > 0
limit 5

 * postgresql://pliu:***@127.0.0.1:5432/weather_stations
5 rows affected.

[(719200, 'C74611', 1978, 2, 5, Decimal('-4.4000000000000003552'), Decimal('962.89999999999997728'), Decimal('14.900000000000000355'), Decimal('13.30000000000000071'), Decimal('1.6000000000000000888'), Decimal('0'), Decimal('9.8000000000000007105'), 0, 0, 0, 0, 0),
 (29880, '921894', 1986, 12, 26, Decimal('13.900000000000000355'), None, Decimal('6.5999999999999996447'), Decimal('14.699999999999999289'), Decimal('16.80000000000000071'), Decimal('0.020000000000000000416'), Decimal('8.6999999999999992894'), 0, 0, 0, 0, 0),
 (700450, '77D245', 1985, 11, 4, Decimal('-12.199999999999999289'), Decimal('1023.7000000000000454'), Decimal('6.2000000000000001776'), Decimal('16.30000000000000071'), Decimal('-7.2000000000000001776'), Decimal('0'), Decimal('0.8000000000000000444'), 1, 1, 1, 1, 1),
 (28010, '423D51', 2004, 2, 15, Decimal('23.699999999999999289'), Decimal('953.70000000000004544'), None, Decimal('6.5999999999999996447'), Decimal('26'), Decimal('0.020000000000000000416'), Decimal('26.399999999999998578'), 0, 0, 0, 0, 0),
 (710830, 'FC6047', 2008, 1, 16, Decimal('-13.699999999999999289'), Decimal('990.6000000000000227'), Decimal('0.4000000000000000222'), Decimal('21.899999999999998578'), Decimal('-8.6999999999999992894'), Decimal('0.10000000000000000555'), Decimal('11.400000000000000355'), 0, 0, 0, 0, 0)]